bagdades/stm32_st7735/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include "st7735.h"
#include "fonts.h"
#include "car.h"
#include "stm32f1xx_hal.h"
#include "splash.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

/* USER CODE BEGIN PV */
ucg_t ucg;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_RTC_Init(void);
static void MX_SPI2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void init() {
    ucg_Init();

    /* const char ready[] = "Ready!\r\n"; */
    /* HAL_UART_Transmit(&huart1, (uint8_t*)ready, sizeof(ready)-1, HAL_MAX_DELAY); */
}

/* void loop() { */
/*     // Check border */
/*     ucg_FillScreen(ST7735_BLACK); */
/*  */
/*     for(int x = 0; x < ST7735_WIDTH; x++) { */
/*         ucg_DrawPixel(x, 0, ST7735_RED); */
/*         ucg_DrawPixel(x, ST7735_HEIGHT-1, ST7735_RED); */
/*     } */
/*  */
/*     for(int y = 0; y < ST7735_HEIGHT; y++) { */
/*         ucg_DrawPixel(0, y, ST7735_RED); */
/*         ucg_DrawPixel(ST7735_WIDTH-1, y, ST7735_RED); */
/*     } */
/*  */
/*     HAL_Delay(3000); */
/*  */
/*     // Check fonts */
/*     ucg_FillScreen(ST7735_BLACK); */
/*     ucg_WriteString(0, 0, "Font_7x10", Font_7x10, ST7735_RED, ST7735_BLACK); */
/*     ucg_WriteString(0, 18, "Font_11x18", Font_11x18, ST7735_GREEN, ST7735_BLACK); */
/*     ucg_WriteString(0, 22+18, "Font_16x26", Font_16x26, ST7735_BLUE, ST7735_BLACK); */
/*     HAL_Delay(2000); */
/*  */
/*     // Check colors */
/*     ucg_FillScreen(ST7735_BLACK); */
/*     ucg_WriteString(0, 0, "BLACK", Font_11x18, ST7735_WHITE, ST7735_BLACK); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_BLUE); */
/*     ucg_WriteString(0, 0, "BLUE", Font_11x18, ST7735_BLACK, ST7735_BLUE); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_RED); */
/*     ucg_WriteString(0, 0, "RED", Font_11x18, ST7735_BLACK, ST7735_RED); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_GREEN); */
/*     ucg_WriteString(0, 0, "GREEN", Font_11x18, ST7735_BLACK, ST7735_GREEN); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_CYAN); */
/*     ucg_WriteString(0, 0, "CYAN", Font_11x18, ST7735_BLACK, ST7735_CYAN); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_MAGENTA); */
/*     ucg_WriteString(0, 0, "MAGENTA", Font_11x18, ST7735_BLACK, ST7735_MAGENTA); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_YELLOW); */
/*     ucg_WriteString(0, 0, "YELLOW", Font_11x18, ST7735_BLACK, ST7735_YELLOW); */
/*     HAL_Delay(500); */
/*  */
/*     ucg_FillScreen(ST7735_WHITE); */
/*     ucg_WriteString(0, 0, "WHITE", Font_11x18, ST7735_BLACK, ST7735_WHITE); */
/*     HAL_Delay(500); */
/*  */
/* 	ucg_DrawImage(0, 0, ST7735_WIDTH, ST7735_HEIGHT, (uint16_t*)test_img_160x80); */
/* 	HAL_Delay(15000); */
/* } */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_RTC_Init();
	MX_SPI2_Init();
	/* USER CODE BEGIN 2 */
	init();
	ucg_SetBackColor(&ucg, C_BLACK);
	ucg_FillScreen(&ucg);
	/* ucg_FillRectangle(1, 1, 10, 10, ST7735_YELLOW); */
	ucg_SetForeColor(&ucg, C_CYAN);
	/* ucg_SetColor(&ucg, 1, ST7735_BLACK); */
	/* ucg_DrawRectangle(&ucg, 10, 10, 160, 160); */
	ucg_SetForeColor(&ucg, C_RED);
	ucg_SetFont(&ucg, (tFont*)&font_18b);
	/* ucg_DrawRoundFrame(&ucg, 20, 20, 100, 40, 10); */
	/* ucg_FillRoundFrame(&ucg, 20, 20, 100, 40, 10); */
	/* ucg_SetColor(&ucg, 0, ST7735_BLACK); */
	/* ucg_SetColor(&ucg, 1, ST7735_GREEN); */
	/* ucg_WriteString(&ucg, 25, 27, "Hello"); */
	/* ucg_SetColor(&ucg, 0, ST7735_GREEN); */
	/* ucg_SetColor(&ucg, 1, ST7735_BLACK); */
	/* ucg_FillCircle(&ucg, 120, 40, 20); */
	/* uint8_t wh; */
	/* char buff[10]; */
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		ucg_WriteString(&ucg, 1, 1, "Hello, World!");
		ucg_DrawBmp(0, 20, &cel, C_GREEN, C_BLACK);
		/* ucg_SetFont(&ucg, (tFont*)&font_53); */
		/* ucg_SetForeColor(&ucg, C_BLACK); */
		/* ucg_SetBackColor(&ucg, C_WHITE); */
		/* ucg_WriteString(&ucg, 1, 24, "1234"); */
		/* wh = ucg_GetStrWidth(&ucg,&Font_16x26, "Hello"); */
		/* sprintf(buff, "%d", wh); */
		/* ucg_WriteString(&ucg, 20, 50, buff); */
		/* loop(); */
		/* ucg_SetForeColor(&ucg, C_RED); */
		/* ucg_WriteString(&ucg, 12, 12, "Hello"); */
		/* HAL_Delay(500); */
		/* ucg_SetForeColor(&ucg, C_BLACK); */
		/* ucg_FillRectangle(&ucg, 12, 12, 84, 26); */
		/* ucg_SetForeColor(&ucg, C_YELLOW); */
		/* ucg_WriteString(&ucg, 12, 40, "Hello"); */
		/* HAL_Delay(500); */
		/* ucg_SetForeColor(&ucg, C_BLACK); */
		/* ucg_FillRectangle(&ucg, 12, 40, 84, 26); */

		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
	}
	/* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief RTC Initialization Function
  * @param None
  * @retval None
  */
static void MX_RTC_Init(void)
{

  /* USER CODE BEGIN RTC_Init 0 */

  /* USER CODE END RTC_Init 0 */

  RTC_TimeTypeDef sTime = {0};
  RTC_DateTypeDef DateToUpdate = {0};

  /* USER CODE BEGIN RTC_Init 1 */

  /* USER CODE END RTC_Init 1 */
  /** Initialize RTC Only
  */
  hrtc.Instance = RTC;
  hrtc.Init.AsynchPrediv = RTC_AUTO_1_SECOND;
  hrtc.Init.OutPut = RTC_OUTPUTSOURCE_NONE;
  if (HAL_RTC_Init(&hrtc) != HAL_OK)
  {
    Error_Handler();
  }

  /* USER CODE BEGIN Check_RTC_BKUP */

  /* USER CODE END Check_RTC_BKUP */

  /** Initialize RTC and set the Time and Date
  */
  sTime.Hours = 0x0;
  sTime.Minutes = 0x0;
  sTime.Seconds = 0x0;

  if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
  {
    Error_Handler();
  }
  DateToUpdate.WeekDay = RTC_WEEKDAY_MONDAY;
  DateToUpdate.Month = RTC_MONTH_JANUARY;
  DateToUpdate.Date = 0x1;
  DateToUpdate.Year = 0x0;

  if (HAL_RTC_SetDate(&hrtc, &DateToUpdate, RTC_FORMAT_BCD) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN RTC_Init 2 */

  /* USER CODE END RTC_Init 2 */

}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void)
{

  /* USER CODE BEGIN SPI2_Init 0 */

  /* USER CODE END SPI2_Init 0 */

  /* USER CODE BEGIN SPI2_Init 1 */

  /* USER CODE END SPI2_Init 1 */
  /* SPI2 parameter configuration*/
  hspi2.Instance = SPI2;
  hspi2.Init.Mode = SPI_MODE_MASTER;
  hspi2.Init.Direction = SPI_DIRECTION_2LINES;
  hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi2.Init.NSS = SPI_NSS_SOFT;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
  hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi2.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI2_Init 2 */

  /* USER CODE END SPI2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(ST7735_CS_GPIO_Port, ST7735_CS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, ST7735_RES_Pin|ST7735_DC_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : ST7735_CS_Pin */
  GPIO_InitStruct.Pin = ST7735_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(ST7735_CS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ST7735_RES_Pin ST7735_DC_Pin */
  GPIO_InitStruct.Pin = ST7735_RES_Pin|ST7735_DC_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

